tube/t_5cm_0.75mm_15mlmin/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }

    inlet
    {
        type               flowRateInletVelocity;
        volumetricFlowRate 0.0000002499; // m^3/s or kg/s
        value              (0 0 0); // placeholder
        extrapolateProfile false;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
